SwiperWitty/Caven-MCU_Lib/Base_CH32V317/Base_UART.c
#include "Base_UART.h"

#if Exist_UART


static iD_pFun State_Machine_UART_pFun[6];

extern void SYS_Base_Delay(int time, int speed);

uint8_t uart0_enable = 0;
uint8_t uart1_enable = 0;
uint8_t uart2_enable = 0;
uint8_t uart3_enable = 0;
uint8_t uart4_enable = 0;

uint8_t uart0_dma_enable = 0;
uint8_t uart1_dma_enable = 0;
uint8_t uart2_dma_enable = 0;
uint8_t uart3_dma_enable = 0;
uint8_t uart4_dma_enable = 0;
// 以下函数单纯方便MCU移植

/*
retval:1 succ
retval:0 fail
*/ 
static uint8_t UART_Wait_TX_Flag(UART_mType Channel)
{
    USART_TypeDef *uart_Temp;

    switch (Channel)
    {
    case 0: return 0;
    case 1: uart_Temp = USART1; break;
    case 2: uart_Temp = USART2; break;
    case 3: uart_Temp = USART3; break;
    case 4: uart_Temp = UART4;  break;
    default: return 0;
    }

    uint32_t retry = 0;
    do
    {
        if (USART_GetFlagStatus(uart_Temp, USART_FLAG_TC) != RESET)
        {
            return 1;
        }
        SYS_Base_Delay(1, 1000);
    } while (++retry < UART_WAIT_MAX);

    return 0;
}

static uint8_t UART_Wait_DMA_Flag(uint32_t flag)
{
    uint32_t retry = 0;
    do
    {
        if (DMA_GetFlagStatus(flag) != RESET)
        {
            return 1;
        }
        SYS_Base_Delay(1, 1000);
    } while (++retry < UART_WAIT_MAX);
    return 0;
}

static char UART_RXD_Flag(UART_mType Channel)
{
    char res;
    USART_TypeDef *uart_Temp;
    switch (Channel)
    {
    case 0:
        return 0;
    case 1:
        uart_Temp = USART1;break;
    case 2:
        uart_Temp = USART2;break;
    case 3:
        uart_Temp = USART3;break;
    case 4:
        uart_Temp = UART4;break;
    default:
        return 0;
    }
    res = USART_GetITStatus(uart_Temp,USART_IT_RXNE);
    return res;
}

static void UART_RXD_Flag_Clear(UART_mType Channel)
{
    USART_TypeDef *uart_Temp;
    switch (Channel)
    {
    case 0:
        return ;
    case 1:
        uart_Temp = USART1;break;
    case 2:
        uart_Temp = USART2;break;
    case 3:
        uart_Temp = USART3;break;
    case 4:
        uart_Temp = UART4;break;
    default:
        return ;
    }
    USART_ClearITPendingBit(uart_Temp, USART_IT_RXNE);
}

static void DMA_RX_IDLE_Clear(UART_mType Channel)
{
    USART_TypeDef *uart_Temp;
    switch (Channel)
    {
    case 0:
        return ;
    case 1:
        uart_Temp = USART1;break;
    case 2:
        uart_Temp = USART2;break;
    case 3:
        uart_Temp = USART3;break;
    case 4:
        uart_Temp = UART4;break;
    default:
        return ;
    }
    USART_ClearITPendingBit(uart_Temp, USART_IT_IDLE);
}

static uint16_t UART_RXD_Receive(UART_mType Channel)     // RXD 读取值
{
    USART_TypeDef *uart_Temp;
    uint16_t res;
    switch (Channel)
    {
    case 0:
        return 0;
    case 1:
        uart_Temp = USART1;break;
    case 2:
        uart_Temp = USART2;break;
    case 3:
        uart_Temp = USART3;break;
    case 4:
        uart_Temp = UART4;break;
    default:
        return 0;
    }
    res = USART_ReceiveData(uart_Temp);
    return res;
}
#endif

void Base_UART_Send_Data(UART_mType Channel,uint16_t Data)
{
#if Exist_UART
    USART_TypeDef *uart_Temp;
    switch (Channel)
    {
    case 0:
        if (uart0_enable == 0)
        {
            return;
        }
        return;
    case 1:
        if (uart1_enable == 0)
        {
            return;
        }
        uart_Temp = USART1;
        break;
    case 2:
        if (uart2_enable == 0)
        {
            return;
        }
        uart_Temp = USART2;
        break;
    case 3:
        if (uart3_enable == 0)
        {
            return;
        }
        uart_Temp = USART3;
        break;
    case 4:
        if (uart4_enable == 0)
        {
            return;
        }
        uart_Temp = UART4;
        break;
    default:
        return;
    }
    USART_ClearFlag(uart_Temp, USART_FLAG_TC);
    USART_SendData(uart_Temp, Data);
    if (UART_Wait_TX_Flag(Channel) == 0)
    {
        return;
    }
#endif
}

#if DMA_UART
    #if Exist_UART & OPEN_0001
uint8_t DMA_UART0_Buff[UART_BUFF_MAX];
    #endif
    #if Exist_UART & OPEN_0010
uint8_t DMA_UART1_Buff[UART_BUFF_MAX];
    #endif
    #if Exist_UART & OPEN_0100
uint8_t DMA_UART2_Buff[UART_BUFF_MAX];
    #endif
    #if Exist_UART & OPEN_1000
uint8_t DMA_UART3_Buff[UART_BUFF_MAX];
    #endif
    #if Exist_UART & OPEN_10000
uint8_t DMA_UART4_Buff[UART_BUFF_MAX];
    #endif
#endif

/*
 * dma 发送，如果没有dma就硬件发送
 */
void Base_UART_DMA_Send_Data(UART_mType Channel,const uint8_t *Data,int Length)
{
#if Exist_UART
    USART_TypeDef *Temp_USART = NULL;
    DMA_InitTypeDef DMA_InitStructure = {0};
    DMA_Channel_TypeDef *Temp_DMA_Channel = NULL;
    uint32_t DMAy_FLAG = 0;
    uint8_t *p_DMA_BUFF = NULL;
    static uint8_t dma_send_First = 0;

    if (Data == NULL || Length <= 0)
    {
        return;
    }

    switch (Channel)
    {
    case 0:
        if (uart0_enable == 0)
        {
            return;
        }
        if ((uart0_dma_enable & UART_DMA_TX_ENABLE) == UART_DMA_TX_ENABLE)
        {
    #if (Exist_UART & OPEN_0001) && DMA_UART
            p_DMA_BUFF = DMA_UART0_Buff;
            Temp_USART = NULL;
            DMAy_FLAG = 0;
            Temp_DMA_Channel = NULL;
    #endif
        }
        break;
    case 1:
        if (uart1_enable == 0)
        {
            return;
        }
        if ((uart1_dma_enable & UART_DMA_TX_ENABLE) == UART_DMA_TX_ENABLE)
        {
    #if (Exist_UART & OPEN_0010) && DMA_UART
            p_DMA_BUFF = DMA_UART1_Buff;
            Temp_USART = USART1;
            DMAy_FLAG = DMA1_FLAG_TC4;
            Temp_DMA_Channel = DMA1_Channel4;
    #endif
        }
        break;
    case 2:
        if (uart2_enable == 0)
        {
            return;
        }
        if ((uart2_dma_enable & UART_DMA_TX_ENABLE) == UART_DMA_TX_ENABLE)
        {
    #if (Exist_UART & OPEN_0100) && DMA_UART
            p_DMA_BUFF = DMA_UART2_Buff;
            Temp_USART = USART2;
            DMAy_FLAG = DMA1_FLAG_TC7;
            Temp_DMA_Channel = DMA1_Channel7;
    #endif
        }
        break;
    case 3:
        if (uart3_enable == 0)
        {
            return;
        }
        if ((uart3_dma_enable & UART_DMA_TX_ENABLE) == UART_DMA_TX_ENABLE)
        {
    #if (Exist_UART & OPEN_1000) && DMA_UART
            p_DMA_BUFF = DMA_UART3_Buff;
            Temp_USART = USART3;
            DMAy_FLAG = DMA1_FLAG_TC2;
            Temp_DMA_Channel = DMA1_Channel2;
    #endif
        }
        break;
    case 4:
        if (uart4_enable == 0)
        {
            return;
        }
        if ((uart4_dma_enable & UART_DMA_TX_ENABLE) == UART_DMA_TX_ENABLE)
        {
    #if (Exist_UART & OPEN_10000) && DMA_UART
            p_DMA_BUFF = DMA_UART4_Buff;
            Temp_USART = UART4;
            DMAy_FLAG = 0;
            Temp_DMA_Channel = NULL;
    #endif
        }
        break;
    default:
        return;
    }

    if (Temp_USART == NULL || Temp_DMA_Channel == NULL || p_DMA_BUFF == NULL)
    {
        while (Length-- > 0)
        {
            Base_UART_Send_Data(Channel, *Data++);
        }
        return;
    }

