SwiperWitty/Caven-MCU_Lib/Base_CH32V317/Base_UART.c
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;       // TXD
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOB, &GPIO_InitStructure);
    if (!temp)
    {
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7;
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
        GPIO_Init(GPIOB, &GPIO_InitStructure);
    }
    #endif

    USART_InitStructure.USART_BaudRate = Baud;
    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None; //
    USART_InitStructure.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;					//
    USART_InitStructure.USART_Parity = USART_Parity_No;								//
    USART_InitStructure.USART_StopBits = USART_StopBits_1;							//
    USART_InitStructure.USART_WordLength = USART_WordLength_8b;						//
    USART_Init(Temp_USART, &USART_InitStructure);
    #if DMA_UART1_RX & DMA_UART
    if(temp)
    {
        Uart_DMA_RX_Switch (m_UART_CH1,&Caven_Double_U1,0);
        uart1_dma_enable |= UART_DMA_RX_ENABLE;
    }
    USART_ITConfig(Temp_USART, USART_IT_IDLE, temp);
    // 
    #else
    USART_ITConfig(Temp_USART, USART_IT_RXNE, temp);
    #endif
    #if DMA_UART
    uart1_dma_enable |= UART_DMA_TX_ENABLE;
    #endif
    if(Set == 0)
    {
        uart1_dma_enable = 0;
    }
    NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1; //抢占优先级
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;		  //响应优先级
    NVIC_InitStructure.NVIC_IRQChannelCmd = temp;
    NVIC_Init(&NVIC_InitStructure);
    
    USART_Cmd(Temp_USART, temp);
    uart1_enable = Set;
}

void UART1_HANDLERIT()
{
    u8 uart_Temp;
    UART_mType UART_CH = m_UART_CH1;
    USART_TypeDef * Temp_USART = USART1;
    if (UART_RXD_Flag(UART_CH))
    {
        uart_Temp = UART_RXD_Receive(UART_CH);
        UART_RXD_Flag_Clear(UART_CH);
        if (State_Machine_UART_pFun[UART_CH] != NULL)
        {
            State_Machine_UART_pFun[UART_CH](&uart_Temp);
        }
    }
    if (USART_GetITStatus(Temp_USART,USART_IT_IDLE))    // 空闲
    {
        uart_Temp = UART_RXD_Receive(UART_CH);
        DMA_RX_IDLE_Clear(UART_CH);
    #if DMA_UART1_RX & DMA_UART
        Uart_DMA_RX_Switch (UART_CH,&Caven_Double_U1,0);
    #endif
    }
}
#endif

#if (Exist_UART & OPEN_0100)
void Uart2_Init(int Baud,int Set)
{
    GPIO_InitTypeDef GPIO_InitStructure = {0};
    USART_InitTypeDef USART_InitStructure = {0};
    NVIC_InitTypeDef NVIC_InitStructure = {0};
    USART_TypeDef * Temp_USART = USART2;
    FunctionalState temp;

    uart2_enable = 0;
    if(Set)
        temp = ENABLE;
    else
        temp = DISABLE;

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, temp);

    USART_DeInit(Temp_USART);

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
    if (!temp)
    {
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2 | GPIO_Pin_3;
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
        GPIO_Init(GPIOA, &GPIO_InitStructure);
    }

    USART_InitStructure.USART_BaudRate = Baud;
    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    USART_InitStructure.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
    USART_InitStructure.USART_Parity = USART_Parity_No;
    USART_InitStructure.USART_StopBits = USART_StopBits_1;
    USART_InitStructure.USART_WordLength = USART_WordLength_8b;
    USART_Init(Temp_USART, &USART_InitStructure);

#if DMA_UART2_RX & DMA_UART
    if(temp)
    {
        Uart_DMA_RX_Switch(m_UART_CH2,&Caven_Double_U2,0);
        uart2_dma_enable |= UART_DMA_RX_ENABLE;
    }
    USART_ITConfig(Temp_USART, USART_IT_IDLE, temp);

    NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel6_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
    NVIC_InitStructure.NVIC_IRQChannelCmd = temp;
    NVIC_Init(&NVIC_InitStructure);
#else
    USART_ITConfig(Temp_USART, USART_IT_RXNE, temp);
#endif

#if DMA_UART
    uart2_dma_enable |= UART_DMA_TX_ENABLE;
#endif
    if(Set == 0)
    {
        uart2_dma_enable = 0;
    }

    NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
    NVIC_InitStructure.NVIC_IRQChannelCmd = temp;
    NVIC_Init(&NVIC_InitStructure);

    USART_Cmd(Temp_USART, temp);
    uart2_enable = Set;
}

void UART2_HANDLERIT()
{
    u8 uart_Temp;
    UART_mType UART_CH = m_UART_CH2;
    USART_TypeDef * Temp_USART = USART2;
    if (UART_RXD_Flag(UART_CH))
    {
        uart_Temp = UART_RXD_Receive(UART_CH);
        UART_RXD_Flag_Clear(UART_CH);
        if (State_Machine_UART_pFun[UART_CH] != NULL)
        {
            State_Machine_UART_pFun[UART_CH](&uart_Temp);
        }
    }
    if (USART_GetITStatus(Temp_USART,USART_IT_IDLE))    // 空闲
    {
        uart_Temp = UART_RXD_Receive(UART_CH);
        DMA_RX_IDLE_Clear(UART_CH);
    #if DMA_UART2_RX & DMA_UART
        Uart_DMA_RX_Switch (UART_CH,&Caven_Double_U2,0);
    #endif
    }
}

    #if DMA_UART2_RX & DMA_UART
void DMA1_CH6_HANDLERIT()
{
    UART_mType UART_CH = m_UART_CH2;
    if (DMA_GetITStatus(DMA1_IT_TC6))    // FULL
    {
        DMA_ClearITPendingBit(DMA1_IT_GL6);
        Uart_DMA_RX_Switch (UART_CH,&Caven_Double_U2,1);
    }
}
    #endif
#endif

#if (Exist_UART & OPEN_1000)
void Uart3_Init(int Baud,int Set)
{
    GPIO_InitTypeDef GPIO_InitStructure = {0};
    USART_InitTypeDef USART_InitStructure = {0};
    NVIC_InitTypeDef NVIC_InitStructure = {0};
    USART_TypeDef * Temp_USART = USART3;
    FunctionalState temp;

    uart3_enable = 0;
    if(Set)
        temp = ENABLE;
    else
        temp = DISABLE;

    RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, temp);

#if (UART3_REMAP == OPEN_0000)
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
    USART_DeInit(Temp_USART);

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOB, &GPIO_InitStructure);
    if (!temp)
    {
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10 | GPIO_Pin_11;
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
        GPIO_Init(GPIOB, &GPIO_InitStructure);
    }
#elif (UART3_REMAP == OPEN_0001)
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
    GPIO_PinRemapConfig(GPIO_PartialRemap_USART3, ENABLE);
    USART_DeInit(Temp_USART);

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOC, &GPIO_InitStructure);

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOC, &GPIO_InitStructure);
    if (!temp)
    {
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10 | GPIO_Pin_11;
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
        GPIO_Init(GPIOC, &GPIO_InitStructure);
    }
#endif

    USART_InitStructure.USART_BaudRate = Baud;
    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    USART_InitStructure.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
    USART_InitStructure.USART_Parity = USART_Parity_No;
    USART_InitStructure.USART_StopBits = USART_StopBits_1;
    USART_InitStructure.USART_WordLength = USART_WordLength_8b;
    USART_Init(Temp_USART, &USART_InitStructure);

#if DMA_UART3_RX & DMA_UART
    if(temp)
    {
        Uart_DMA_RX_Switch(m_UART_CH3,&Caven_Double_U3,0);
        uart3_dma_enable |= UART_DMA_RX_ENABLE;
    }
    USART_ITConfig(Temp_USART, USART_IT_IDLE, temp);

    NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel3_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;
    NVIC_InitStructure.NVIC_IRQChannelCmd = temp;
    NVIC_Init(&NVIC_InitStructure);
#else
    USART_ITConfig(Temp_USART, USART_IT_RXNE, temp);
#endif

#if DMA_UART
    uart3_dma_enable |= UART_DMA_TX_ENABLE;
#endif
    if(Set == 0)
    {
        uart3_dma_enable = 0;
    }

    NVIC_InitStructure.NVIC_IRQChannel = USART3_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;
    NVIC_InitStructure.NVIC_IRQChannelCmd = temp;
    NVIC_Init(&NVIC_InitStructure);

    USART_Cmd(Temp_USART, temp);
    uart3_enable = Set;
}

